app/Models/MyModel.php

public function get_order_items($orderId)
{
    return $this->db->table('tbl_orders o')
        ->select('
            o.item_quantity,
            o.total_amount,
            i.name AS item_name,
            i.image AS item_image
        ')
        ->join('tbl_items i','i.id = o.item_id')
        ->where('o.id',$orderId)
        ->get()
        ->getResultArray();
---
SELECT `o`.`item_quantity`, `o`.`total_amount`, `i`.`name` AS `item_name`, `i`.`image` AS `item_image`
FROM `tbl_orders` `o`
JOIN `tbl_items` `i` ON `i`.`id` = `o`.`item_id`
WHERE `o`.`id` = '67'

public function get_order_summary($orderId)
{
    return $this->db->table('tbl_orders')
        ->select('id,user_id,item_id,item_quantity,order_date,del_status,total_amount,order_status,del_date')
        ->where('id',$orderId)
        ->get()
        ->getRowArray();
---
SELECT `id`, `user_id`, `item_id`, `item_quantity`, `order_date`, `del_status`, `total_amount`, `order_status`, `del_date`
FROM `tbl_orders`
WHERE `id` = '67'

public function get_cart_count($userId)
{
    $count = $this->db->table('tbl_cart')
        ->select('item_id')
        ->where('user_id', $userId)
        ->where('status', 0)
        ->distinct()
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `item_id`
FROM `tbl_cart`
WHERE `user_id` = '6'
AND `status` = 0
) CI_count_all_results