app/Models/MyModel.php

public function user_cartitems($userid){
    return $this->db
    ->table('tbl_cart c')
    ->select(
        'c.id AS cart_id,
        c.quantity,
        i.id AS item_id,
        i.quantity AS item_stock,
        i.name,
        i.amount,
        i.image'
    )

    ->join('tbl_items i','i.id=c.item_id','left')
    ->where('c.user_id',$userid)
    ->where('c.status' , 0)
    ->get()
    ->getResultArray();
---
SELECT `c`.`id` AS `cart_id`, `c`.`quantity`, `i`.`id` AS `item_id`, `i`.`quantity` AS `item_stock`, `i`.`name`, `i`.`amount`, `i`.`image`
FROM `tbl_cart` `c`
LEFT JOIN `tbl_items` `i` ON `i`.`id`=`c`.`item_id`
WHERE `c`.`user_id` = '6'
AND `c`.`status` = 0

public function get_user_orders($userId)
{
    return $this->db
        ->table('tbl_orders o')
        ->select('
            o.id AS order_id,
            o.total_amount,
            o.order_status,
            o.del_date,
            GROUP_CONCAT(i.name ORDER BY oi.id) AS item_names,
            GROUP_CONCAT(oi.item_quantity ORDER BY oi.id) AS item_quantities,
            GROUP_CONCAT(i.image ORDER BY oi.id) AS item_images
        ')
        ->join('tbl_order_items oi', 'oi.order_id = o.id', 'left')
        ->join('tbl_items i', 'i.id = oi.item_id', 'left')
        ->where('o.user_id', $userId)
        ->where('o.status', 0)
        ->groupBy('o.id')
        ->orderBy('o.del_date', 'ASC')
        ->get()
        ->getResultArray();
---
SELECT `o`.`id` AS `order_id`, `o`.`total_amount`, `o`.`order_status`, `o`.`del_date`, GROUP_CONCAT(i.name ORDER BY oi.id) AS item_names, GROUP_CONCAT(oi.item_quantity ORDER BY oi.id) AS item_quantities, GROUP_CONCAT(i.image ORDER BY oi.id) AS item_images
FROM `tbl_orders` `o`
LEFT JOIN `tbl_order_items` `oi` ON `oi`.`order_id` = `o`.`id`
LEFT JOIN `tbl_items` `i` ON `i`.`id` = `oi`.`item_id`
WHERE `o`.`user_id` = '7'
AND `o`.`status` = 0
GROUP BY `o`.`id`
ORDER BY `o`.`del_date` ASC

public function get_cart_count($userId)
{
    $count = $this->db->table('tbl_cart')
        ->select('item_id')
        ->where('user_id', $userId)
        ->where('status', 0)
        ->distinct()
        ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `item_id`
FROM `tbl_cart`
WHERE `user_id` = '7'
AND `status` = 0
) CI_count_all_results