app/Models/MyModel.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `item_id`
FROM `tbl_cart`
WHERE `user_id` = '5'
AND `status` = 0
) CI_count_all_results
---
public function get_cart_count($userId)
{
    $count = $this->db->table('tbl_cart')
        ->select('item_id')
        ->where('user_id', $userId)
        ->where('status', 0)
        ->distinct()
        ->countAllResults();